In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [2]:
mydf = {'experience' :[None, None, 'five', 'two', 'seven', 'three', 'ten', 'eleven'],
       'test_score' : [8, 8, 6, 10, 9, 7, None, 7],
       'interview_score' : [9, 6, 7, 10, 6, 10, 7, 8],
       'salary' : [5000, 45000, 60000, 65000, 70000, 62000, 72000, 80000]}

In [3]:
df= pd.DataFrame(mydf)

In [4]:
df

  experience  test_score  interview_score  salary
0       None         8.0                9    5000
1       None         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [5]:
df.to_csv('hiring.csv')

In [6]:
df.test_score = df.test_score.fillna(df.test_score.median())

In [7]:
df

  experience  test_score  interview_score  salary
0       None         8.0                9    5000
1       None         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [8]:
 df =df.fillna(value = np.nan)

In [9]:
df.experience = df.experience.fillna('two')

In [10]:
df

  experience  test_score  interview_score  salary
0        two         8.0                9    5000
1        two         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [11]:
# independent: experience, test_score, interview_score
# dependent: salary
# model.fit(independent, dependent)

In [12]:
df

  experience  test_score  interview_score  salary
0        two         8.0                9    5000
1        two         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [14]:
df = df.replace(to_replace = 'two', value = 2)

In [16]:
df = df.replace(to_replace = 'three', value = 3)

In [17]:
df = df.replace(to_replace = 'ten', value = 10)
df = df.replace(to_replace = 'seven', value = 7)
df = df.replace(to_replace = 'five', value = 5)
df = df.replace(to_replace = 'eleven', value = 11)

In [18]:
df

   experience  test_score  interview_score  salary
0           2         8.0                9    5000
1           2         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

In [19]:
df.to_csv('hiring.csv')

In [20]:
model = linear_model.LinearRegression()
model.fit( df.drop( 'salary', axis = 'columns' ), df.salary )

LinearRegression()

In [21]:
model.predict([[2, 9, 6]])

c:\users\mecha\appdata\local\programs\python\python39\lib\site-packages\sklearn\base.py:441: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([43458.44213043])

In [22]:
model.predict([[12, 10, 10]])

c:\users\mecha\appdata\local\programs\python\python39\lib\site-packages\sklearn\base.py:441: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([96003.05156196])